           IDENTIFICATION DIVISION.
           PROGRAM-ID. hello.
           PROCEDURE DIVISION.
               DISPLAY "HELLO COBOL!".
               STOP RUN.
